Repository: 84000/data-translation-memory
Catalog: Toh_147-The_Teaching_on_the_Great_Compassion_of_the_Tathagata-v1.tmx
Source language: bo
Languages: en

source: འདི་ལ་དོན་དམ་པར་གང་སྟོང་པ་ཞེས་བྱ་བའི་ཆོས་གང་ཡང་དམིགས་སུ་མེད་ཀྱང་སྟོང་པ་ཞེས་ཀྱང་བརྗོད་དོ། །
en: In this regard, ultimately, the phenomena that are referred to as empty are without any objective reference whatsoever, but they are still called empty.

source: ཇི་ལྟར་ནམ་མཁའ་ལ་ནམ་མཁའ་ཞེས་རྗོད་ཀྱང་ནམ་མཁའ་ནི་བརྗོད་པར་བྱ་བ་མ་ཡིན་པ་དེ་བཞིན་དུ་སྟོང་པ་ལ་སྟོང་པ་ཞེས་རྗོད་ཀྱང་སྟོང་པ་ནི་བརྗོད་པར་བྱ་བ་མ་ཡིན་ནོ། །
en: Just as we call space space even though space is actually indescribable, we call what is empty empty even though emptiness is actually indescribable.

source: འདི་ལྟ་སྟེ། མིང་མེད་པ་ལ་མིང་དུ་ཐ་སྙད་འདོགས་པ་དེ་ནི་ཆོས་ཐམས་ཅད་ལ་འཇུག་པའོ། །
en: It is like this. This convention of using names to label what is nameless is applied to all phenomena.

source: མིང་དེ་ཡང་ཡུལ་ན་གནས་པ་མ་ཡིན།
en: A name also does not inhere in the object or in a part of it.

source: ཕྱོགས་ན་གནས་པ་མ་ཡིན་ནོ། །ཇི་ལྟར་མིང་ཡུལ་ན་གནས་པ་མ་ཡིན། ཕྱོགས་ན་གནས་པ་མ་ཡིན་པ་དེ་བཞིན་དུ་མིང་གང་གིས་ཆོས་གང་བརྗོད་པའི་ཆོས་དེ་ཡང་ཡུལ་ན་གནས་པ་མ་ཡིན། ཕྱོགས་ན་གནས་པ་མ་ཡིན་ནོ། །
en: Just as names do not inhere in objects or in their parts, in the same way, whatever phenomenon described by a given name also does not inhere in the object or in part of it.

source: དེ་ལྟར་དེ་བཞིན་གཤེགས་པས་ཆོས་དེ་དག་ཐམས་ཅད་མཁྱེན་ཏེ།
en: “In that way tathāgatas understand all these phenomena.

source: གཟོད་མ་ནས་མ་སྐྱེས་པ་དང་། མ་འགགས་པ་དང་། མཚན་ཉིད་མེད་པ་དང་། སེམས་དང་། ཡིད་དང་། རྣམ་པར་ཤེས་པ་དང་བྲལ་བ་དང་། ཡི་གེ་མེད་པ་དང་། སྒྲ་མེད་པར་ཤེས་སོ། །
en: They understand them to be primordially unborn, unceasing, without attributes, devoid of mind, mental activity, and consciousness, and without letters or sounds.

source: ཇི་ལྟར་ཤེས་པ་དེ་བཞིན་དུ་རྣམ་པར་གྲོལ་ཏེ།
en: Insofar as they understand them, they are liberated.

source: བཅིངས་པ་ཡང་མེད།
en: There is no bondage.

source: གྲོལ་བ་ཡང་མེད་དོ། །
en: There is also no liberation.

source: མཉམ་པ་ཉིད་འདི་ཡང་བྱིས་པ་སོ་སོའི་སྐྱེ་བོ་དག་གིས་ཁོང་དུ་མ་ཆུད་པས་དེ་དག་གིས་ཁོང་དུ་ཆུད་པར་བྱའོ་སྙམ་དུ་སེམས་ཅན་རྣམས་ལ་དེ་བཞིན་གཤེགས་པའི་ཐུགས་རྗེ་ཆེན་པོ་འཇུག་གོ། །
en: Great tathāgata compassion extends to beings with the thought, ‘Immature ordinary beings do not comprehend this sameness. They should comprehend it.’

source: རིགས་ཀྱི་བུ་བྱང་ཆུབ་ནི་ནམ་མཁའ་དང་མཉམ་སྟེ།
en: “Son of noble family, awakening is similar to space.

source: ནམ་མཁའ་ནི་མཉམ་པའང་མ་ཡིན། མི་མཉམ་པའང་མ་ཡིན་ནོ། །
en: Space itself is never the same, but it is also never not the same.

source: བྱང་ཆུབ་ཀྱང་མཉམ་པའང་མ་ཡིན། མི་མཉམ་པའང་མ་ཡིན་ནོ། །
en: Awakening too is never the same, but it is also never not the same.

source: ཆོས་གང་ལ་ཡང་དག་པར་ཡོངས་སུ་གྲུབ་པ་མེད་པ་དེ་མཉམ་པའམ་མི་མཉམ་པར་བརྗོད་པ་མ་ཡིན་ནོ། །
en: Since phenomena do not truly exist, one cannot say whether they are the same or not the same.

source: དེ་ལྟར་དེ་བཞིན་གཤེགས་པས་ཆོས་ཐམས་ཅད་མཉམ་པའང་མ་ཡིན། མི་མཉམ་པའང་མ་ཡིན་པར་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ཏེ།
en: This is what tathāgatas realize when they fully awaken to the fact that all phenomena are not the same and are not not the same.

source: ཇི་ལྟར་ཆོས་ཆུང་ཟད་ཙམ་ཡང་མཉམ་པར་ཡང་མི་བྱེད། མི་མཉམ་པར་ཡང་མི་བྱེད་པ་དེ་ལྟར་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་སོ། །
en: They fully awaken without making even the slightest phenomenon the same or not the same.

source: ཆོས་འདི་དག་ཅི་འདྲ་བ་དེ་འདྲ་བར་ཡང་དག་པའི་ཡེ་ཤེས་ཀྱིས་མཁྱེན་ཏོ། །
en: “They understand with correct wisdom exactly what these phenomena are like.

source: ཡང་དག་པའི་ཡེ་ཤེས་ཀྱང་གང་ཞེ་ན།
en: What is correct wisdom?

source: འདི་ལྟ་སྟེ། ཆོས་ཐམས་ཅད་ནི་རྩ་བ་མེད་པ། མ་སྐྱེས་པ། མ་འགགས་པ་སྟེ།
en: It is the understanding that all phenomena are without root, that they are unborn and unceasing.

source: དེ་དག་ནི་མ་བྱུང་བ་ལས་འབྱུང་བ། བྱུང་ནས་ཀྱང་འབྲལ་བའོ། །
en: They arise out of the unarisen. Having arisen, they pass away.

source: དེ་དག་ནི་བདག་པོ་མེད་པར་འབྱུང་བ། བདག་པོ་མེད་པར་འབྲལ་བའོ། །
en: They arise without a creator, and they pass away without a creator.

source: དེ་ལྟར་འབྱུང་བ་དང་འཇིག་པ་ལ་བརྟེན་ནས་འཇུག་ཀྱང་འདི་ལ་འཇུག་པ་གང་ཡང་མེད་དེ།
en: “In that way, though phenomena come to be through arising and perishing, there is no coming to be whatsoever.

source: ལམ་བཅད་པའི་ཕྱིར་དེ་བཞིན་གཤེགས་པ་ཆོས་སྟོན་ཏོ་ཞེས་ཀྱང་བརྗོད་དོ། །
en: It is said that ‘the tathāgatas teach the Dharma in order to cut off the pathways of existence.’

source: ལམ་ཆད་པ་དེ་ཡང་སེམས་ཅན་རྣམས་ཀྱིས་ཁོང་དུ་མ་ཆུད་པས་དེ་དག་གིས་ཁོང་དུ་ཆུད་པར་བྱའོ་སྙམ་དུ་སེམས་ཅན་རྣམས་ལ་དེ་བཞིན་གཤེགས་པའི་ཐུགས་རྗེ་ཆེན་པོ་འཇུག་གོ། །
en: Great tathāgata compassion extends to beings with the thought, ‘Sentient beings do not comprehend how to cut off the pathways of existence. They should comprehend it.’

source: རིགས་ཀྱི་བུ་བྱང་ཆུབ་ཅེས་བྱ་བ་དེ་ནི་ཇི་ལྟ་བ་བཞིན་གྱི་གནས་སོ། །
en: “Son of noble family, awakening is a real ground.

source: དེ་ལ་ཇི་ལྟ་བ་བཞིན་གྱི་གནས་གང་ཞེ་ན།
en: What is a real ground?

source: བྱང་ཆུབ་ཇི་ལྟ་བར་གཟུགས་ཀྱང་དེ་བཞིན་ཏེ། དེ་བཞིན་ཉིད་ལས་མི་འདའོ། །
en: As is awakening, so is form, which does not transcend suchness.

source: བྱང་ཆུབ་ཇི་ལྟ་བར་ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་རྣམས་དང་། རྣམ་པར་ཤེས་པ་ཡང་དེ་བཞིན་ཏེ། དེ་བཞིན་ཉིད་ལས་མི་འདའོ། །
en: As is awakening, so are feeling, perception, formations, and consciousness, which do not transcend suchness.

source: བྱང་ཆུབ་ཇི་ལྟ་བར། སའི་ཁམས་དང་། ཆུའི་ཁམས་དང་། མེའི་ཁམས་དང་། རླུང་གི་ཁམས་ཀྱང་དེ་བཞིན་ཏེ། དེ་བཞིན་ཉིད་ལས་མི་འདའོ། །
en: As is awakening, so are the elements of earth, water, fire, and wind, which do not transcend suchness.

source: བྱང་ཆུབ་ཇི་ལྟ་བར་མིག་གི་ཁམས་དང་། གཟུགས་ཀྱི་ཁམས་དང་། མིག་གི་རྣམ་པར་ཤེས་པའི་ཁམས་ཀྱང་དེ་བཞིན་ཏེ། དེ་བཞིན་ཉིད་ལས་མི་འདའོ། །
en: As is awakening, so are the elements of eye, form, and visual consciousness, which do not transcend suchness.

source: བྱང་ཆུབ་ཇི་ལྟ་བར་རྣ་བའི་ཁམས་དང་། སྒྲའི་ཁམས་དང་། རྣ་བའི་རྣམ་པར་ཤེས་པའི་ཁམས་དང་།
en: As is awakening, so are the elements of ear, sound, and auditory consciousness, which do not transcend suchness.

source: སྣའི་ཁམས་དང་། དྲིའི་ཁམས་དང་། སྣའི་རྣམ་པར་ཤེས་པའི་ཁམས་དང་།
en: As is awakening, so are the elements of nose, smell, and olfactory consciousness, which do not transcend suchness.

source: ལྕེའི་ཁམས་དང་། རོའི་ཁམས་དང་། ལྕེའི་རྣམ་པར་ཤེས་པའི་ཁམས་དང་།
en: As is awakening, so are the elements of tongue, taste, and gustatory consciousness, which do not transcend suchness.

source: ལུས་ཀྱི་ཁམས་དང་། རེག་བྱའི་ཁམས་དང་། ལུས་ཀྱི་རྣམ་པར་ཤེས་པའི་ཁམས་དང་།
en: As is awakening, so are the elements of body, tactile sensation, and tactile consciousness, which do not transcend suchness.

source: ཡིད་ཀྱི་ཁམས་དང་། ཆོས་ཀྱི་ཁམས་དང་། ཡིད་ཀྱི་རྣམ་པར་ཤེས་པའི་ཁམས་ཀྱང་དེ་བཞིན་ཏེ། དེ་བཞིན་ཉིད་ལས་མི་འདའོ། །
en: As is awakening, so are the elements of mind, phenomena, and mental consciousness, which do not transcend suchness.

source: ཆོས་སུ་བཏགས་པ་ནི་འདི་དག་ཏུ་ཟད་དེ།
en: It is just these that are labeled as phenomena.

source: འདི་ལྟར་ཕུང་པོ་དང་། ཁམས་དང་། སྐྱེ་མཆེད་དུ་བཏགས་པའོ། །
en: In this regard, they are labeled as aggregates, elements, and sense fields.

source: དེ་དག་ནི་དེ་བཞིན་གཤེགས་པས་ཇི་ལྟ་བ་བཞིན་དུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་སོ། །ཕྱིན་ཅི་མ་ལོག་པར་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་སོ། །
en: “It is to these as they really are that the tathāgatas are completely and perfectly awakened, completely and perfectly awakened in an unmistaken manner.

source: དེ་དག་ནི་སྔོན་གྱི་ཇི་ལྟ་བར་ཕྱིས་ཀྱང་དེ་བཞིན་བར་དུ་ཡང་དེ་བཞིན་ཏེ།
en: As these were before, so they are later, and so they are in the meantime.

source: སྔོན་གྱི་མཐར་ཡང་མ་སྐྱེས། ཕྱི་མའི་མཐར་ཡང་མི་འཕོ། བར་དུ་ཡང་དབེན་པ་དག་གོ། །
en: They do not arise in the beginning, they do not pass on in the end, and they are devoid in the meantime.

source: དེ་ལྟར་ན་འདི་ནི་ཇི་ལྟ་བ་བཞིན་གྱི་གནས་ཡིན་ནོ། །
en: This is a real ground.

source: གཅིག་ཇི་ལྟ་བར་ཐམས་ཅད་ཀྱང་དེ་བཞིན། ཐམས་ཅད་ཇི་ལྟ་བར་གཅིག་ཀྱང་དེ་བཞིན་ཏེ།
en: As one is, so are they all. As they all are, so is one.

source: ཇི་ལྟ་བ་བཞིན་ལ་ནི་གཅིག་པའམ་མང་བར་མི་དམིགས་སོ། །
en: The tathāgatas do not objectify the way things are in terms of one or many.

source: ཇི་ལྟ་བ་བཞིན་གྱི་གནས་འདི་འང་བྱིས་པ་སོ་སོའི་སྐྱེ་བོ་རྣམས་ཀྱིས་ཁོང་དུ་མ་ཆུད་པས་དེ་དག་གིས་ཁོང་དུ་ཆུད་པར་བྱའོ་སྙམ་དུ་སེམས་ཅན་རྣམས་ལ་དེ་བཞིན་གཤེགས་པའི་ཐུགས་རྗེ་ཆེན་པོ་འཇུག་གོ། །
en: Great tathāgata compassion extends to beings with the thought, ‘Immature ordinary beings do not comprehend the real ground. They should comprehend it.’

source: རིགས་ཀྱི་བུ་བྱང་ཆུབ་ནི་རྣམ་པ་ལ་འཇུག་པས་རྣམ་པ་མེད་པ་ལ་ཞུགས་པའོ། །
en: “Son of noble family, awakening consists in having penetrated the absence of aspects through penetrating the aspects.

source: དེ་ལ་རྣམ་པ་ནི་གང་། རྣམ་པ་མེད་པ་ནི་གང་ཞེ་ན།
en: In this regard, what are the aspects? What is the absence of aspects?

source: རྣམ་པ་ཞེས་བྱ་བ་ནི་དགེ་བའི་ཆོས་ཐམས་ཅད་རྩོམ་པའོ། །
en: Aspects refers to taking up all virtuous factors.

source: རྣམ་པ་མེད་པ་ཞེས་བྱ་བ་ནི་ཆོས་ཐམས་ཅད་མི་དམིགས་པའོ། །
en: Absence of aspects refers to not objectifying any factor.

source: རྣམ་པ་ཞེས་བྱ་བ་ནི་གནས་པ་མེད་པའི་སེམས་ཀྱི་གནས་སོ། །
en: Aspects refers to the ground of the mind that is groundless.

source: རྣམ་པ་མེད་པ་ཞེས་བྱ་བ་ནི་མཚན་མ་མེད་པའི་ཏིང་ངེ་འཛིན་གྱི་རྣམ་པར་ཐར་པའི་སྒོའོ། །
en: Absence of aspects refers to the gate of liberation, a meditative absorption without signs.

source: རྣམ་པ་ཞེས་བྱ་བ་ནི་ཆོས་རྣམས་ལ་སེམས་པ་དང་། འཇལ་བ་དང་། བགྲང་བ་དང་། སོ་སོར་རྟོག་པའོ། །
en: Aspects refers to thinking about, evaluating, enumerating, and discriminating phenomena.

source: རྣམ་པ་མེད་པ་ཞེས་བྱ་བ་ནི་འཇལ་བ་ལས་ཤིན་ཏུ་འདས་པའོ། །
en: Absence of aspects refers to the complete transcendence of evaluation.

source: འཇལ་བ་ལས་ཤིན་ཏུ་འདས་པ་གང་ཞེ་ན།
en: What is the complete transcendence of evaluation?

source: གང་ལ་རྣམ་པར་ཤེས་པའི་ལས་མེད་པའོ། །
en: It is that in which there is no activity of consciousness.

source: རྣམ་པ་ཞེས་བྱ་བ་ནི་འདུས་བྱས་ལ་སོ་སོར་རྟོག་པའོ། །
en: Aspects refers to discriminating conditioned things.

source: རྣམ་པ་མེད་པ་ཞེས་བྱ་བ་ནི་འདུས་མ་བྱས་ལ་མངོན་སུམ་དུ་བྱེད་པའོ། །
en: Absence of aspects refers to realizing the unconditioned.

source: རྣམ་པ་དང་རྣམ་པ་མེད་པ་ལ་འཇུག་པ་འདི་ཡང་བྱིས་པ་སོ་སོའི་སྐྱེ་བོ་རྣམས་ཀྱིས་ཁོང་དུ་མ་ཆུད་པས་དེ་དག་གིས་ཁོང་དུ་ཆུད་པར་བྱའོ་སྙམ་དུ་སེམས་ཅན་རྣམས་ལ་དེ་བཞིན་གཤེགས་པའི་ཐུགས་རྗེ་ཆེན་པོ་འཇུག་གོ། །
en: Great tathāgata compassion extends to beings with the thought, ‘Immature ordinary beings do not comprehend penetrating the aspects and the absence of aspects. They should comprehend it.’

source: རིགས་ཀྱི་བུ་བྱང་ཆུབ་ནི་ཟག་པ་མེད་པ་དང་། ཉེ་བར་ལེན་པ་མེད་པའོ། །
en: “Son of noble family, awakening is the absence of contamination and the absence of appropriation.

source: དེ་ལ་ཟག་པ་མེད་པ་ནི་གང་། ཉེ་བར་ལེན་པ་མེད་པ་ནི་གང་ཞེ་ན།
en: In this regard, what is the absence of contamination? What is the absence of appropriation?

source: ཟག་པ་མེད་པ་ཞེས་བྱ་བ་ནི་ཟག་པ་བཞི་དང་བྲལ་བའི་ཕྱིར་ཏེ།
en: Absence of contamination means freedom from the four contaminants:

source: འདོད་པའི་ཟག་པ་དང་བྲལ་བ་དང་། སྲིད་པའི་ཟག་པ་དང་བྲལ་བ་དང་། མ་རིག་པའི་ཟག་པ་དང་བྲལ་བ་དང་། ལྟ་བའི་ཟག་པ་དང་བྲལ་བའི་ཕྱིར་རོ། །
en: freedom from the contaminant of desire, freedom from the contaminant of becoming, freedom from the contaminant of ignorance, and freedom from the contaminant of views.

source: ཉེ་བར་ལེན་པ་མེད་པ་ཞེས་བྱ་བ་ནི་ཉེ་བར་ལེན་པ་བཞི་དང་བྲལ་བའི་ཕྱིར་ཏེ།
en: Absence of appropriation refers to freedom from the four appropriations:

source: འདི་ལྟར་འདོད་པའི་ཉེ་བར་ལེན་པ་དང་བྲལ་བ་དང་། ལྟ་བའི་ཉེ་བར་ལེན་པ་དང་བྲལ་བ་དང་། བདག་ཏུ་སྨྲ་བའི་ཉེ་བར་ལེན་པ་དང་བྲལ་བ་དང་། ཚུལ་ཁྲིམས་དང་བརྟུལ་ཞུགས་མཆོག་ཏུ་འཛིན་པའི་ཉེ་བར་ལེན་པ་དང་བྲལ་བའི་ཕྱིར་རོ། །
en: freedom from the appropriation of desire, freedom from the appropriation of views, freedom from the appropriation of asserting a self, and freedom from the appropriation of belief in the supremacy of one’s morality and asceticism.

source: དེ་ལ་ཉེ་བར་ལེན་པ་བཞི་པོ་འདི་དག་ཐམས་ཅད་ཀྱང་མ་རིག་པས་མུན་པར་བྱས་ཤིང་སྲེད་པས་བསྙེན་ཏེ།
en: These four appropriations are darkened by ignorance and approached through craving.

source: བདག་གོ་སྙམ་དུ་མངོན་པར་ཞེན་པས་ཉེ་བར་ལེན་པ་དག་གོ། །
en: Thinking ‘I am,’ they are appropriated through clinging.

source: དེ་ལ་དེ་བཞིན་གཤེགས་པས་བདག་ཉེ་བར་ལེན་པའི་རྩ་བ་ཡོངས་སུ་ཤེས་ནས། བདག་རྣམ་པར་དག་པས་སེམས་ཅན་རྣམ་པར་དག་པར་རྟོགས་སོ། །
en: The tathāgatas understand the I to be the root of appropriation, and they realize that purification of the self is the purification of sentient beings.

source: བདག་རྣམ་པར་དག་པ་གང་ཡིན་པ་དང་། སེམས་ཅན་ཐམས་ཅད་རྣམ་པར་དག་པ་གང་ཡིན་པ་དེ་གཉིས་སུ་མེད་ཅིང་གཉིས་སུ་དབྱེར་མེད་དོ། །
en: The purification of the self and the purification of all sentient beings are an inseparable nonduality.

source: གཉིས་སུ་མེད་པའི་དོན་གང་ཡིན་པ་དེ་སྐྱེ་བ་མེད་དོ། །
en: Nonduality refers to nonarising.

source: སྐྱེ་བ་དང་འགག་པ་མེད་པས་སེམས་དང་། ཡིད་དང་། རྣམ་པར་ཤེས་པ་རྣམས་མི་འཇུག་གོ། །
en: Due to nonarising and noncessation, mind, mental activity, and consciousness do not operate.

source: གང་ལ་སེམས་དང་། ཡིད་དང་། རྣམ་པར་ཤེས་པ་མི་འཇུག་པ་དེ་ལ་ཡོངས་སུ་རྟོག་པ་གང་གིས་ཚུལ་བཞིན་མ་ཡིན་པ་ཡིད་ལ་བྱེད་པར་འགྱུར་བའི་ཡོངས་སུ་རྟོག་པ་གང་ཡང་མེད་དོ། །
en: Where mind, mental activity, and consciousness do not operate, there is absolutely none of the false imagining of incorrect mental activity.

source: དེར་ཚུལ་བཞིན་ཡིད་ལ་བྱེད་པ་དང་ལྡན་པས་མ་རིག་པ་ཀུན་ནས་མི་སློང་ངོ་། །
en: “Someone with correct mental activity does not activate ignorance.

source: གང་མ་རིག་པ་ཀུན་ནས་མི་ལྡང་བ་དེ་སྲིད་པའི་ཡན་ལག་བཅུ་གཉིས་ཀུན་ནས་མི་ལྡང་ངོ་། །
en: When ignorance does not arise, the twelve links of becoming do not arise.

source: གང་སྲིད་པའི་ཡན་ལག་བཅུ་གཉིས་ཀུན་ནས་མི་ལྡང་བ་དེ་མི་སྐྱེ་བའོ། །
en: When the twelve links of becoming do not arise, there is no birth.

source: གང་མི་སྐྱེ་བ་དེ་ངེས་པར་གྱུར་པའོ། །
en: That which is unborn is certain.

source: གང་ངེས་པར་གྱུར་པ་དེ་ངེས་པའི་དོན་ཏོ། །
en: That which is certain is the definitive meaning.

source: ངེས་པའི་དོན་གང་ཡིན་པ་དེ་དོན་དམ་པའོ། །
en: That which is the definitive meaning is the ultimate.

source: དོན་དམ་པ་གང་ཡིན་པ་དེ་གང་ཟག་མེད་པའི་དོན་ཏོ། །
en: That which is ultimate means the reality devoid of a person.

source: གང་ཟག་མེད་པའི་དོན་གང་ཡིན་པ་དེ་བརྗོད་དུ་མེད་པའི་དོན་ཏོ། །
en: The reality devoid of a person is inexpressible.

source: བརྗོད་དུ་མེད་པའི་དོན་གང་ཡིན་པ་དེ་རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བའི་དོན་ཏོ། །
en: The inexpressible is dependent arising.

source: རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བའི་དོན་གང་ཡིན་པ་དེ་ཆོས་ཀྱི་དོན་ཏོ། །
en: Dependent arising is the Dharma.

source: ཆོས་ཀྱི་དོན་གང་ཡིན་པ་དེ་དེ་བཞིན་ཉིད་ཀྱི་དོན་ཏོ། །
en: The Dharma is suchness.

source: དེ་བཞིན་ཉིད་ཀྱི་དོན་གང་ཡིན་པ་དེ་དེ་བཞིན་གཤེགས་པའི་དོན་ཏོ། །
en: Suchness is the tathāgata.

source: དེས་ན་སུས་རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བ་མཐོང་བ་དེས་ཆོས་མཐོང་ངོ་། །སུས་ཆོས་མཐོང་བ་དེས་དེ་བཞིན་གཤེགས་པ་མཐོང་ངོ་ཞེས་བྱ་སྟེ།
en: Therefore, it is said that ‘whoever sees dependent arising sees the Dharma, and whoever sees the Dharma sees the tathāgata.’

source: ཇི་ལྟར་དེ་བཞིན་ཉིད་ཀྱིས་ཡོངས་སུ་བཙལ་ན་ཅི་ཡང་མི་མཐོང་བ་དེ་ལྟར་མཐོང་ངོ་། །
en: When one searches, informed by suchness, one sees nothing whatsoever, and that is how one sees.

source: དེ་ལ་ཅི་ཡང་ཞེས་བྱ་བ་གང་ཞེ་ན།
en: What is that ‘nothing whatsoever?’

source: འདི་ལྟ་སྟེ། མཚན་མ་དང་དམིགས་པའོ། །
en: The answer is ‘conceptual signs and objective references.’

source: དེས་གང་གི་ཚེ་སེམས་མེད་པ་དང་དམིགས་པ་མེད་པར་མཐོང་བ་དེའི་ཚེ་ཡང་དག་པ་མཐོང་ངོ་། །
en: At the time when one sees without thought or objective reference, one sees truly.

source: དེ་ལྟར་དེ་བཞིན་གཤེགས་པས་ཆོས་དེ་དག་མཉམ་པ་ཉིད་ཀྱིས་མཉམ་པར་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་སོ། །
en: In this manner, tathāgatas completely and perfectly awaken, by means of sameness, to the sameness of all phenomena.

source: ཟག་པ་མེད་པ་དང་། ཉེ་བར་ལེན་པ་མེད་པ་འདི་ཡང་སེམས་ཅན་རྣམས་ཀྱིས་ཁོང་དུ་མ་ཆུད་པས་དེ་དག་གིས་ཁོང་དུ་ཆུད་པར་བྱའོ་སྙམ་དུ་སེམས་ཅན་རྣམས་ལ་དེ་བཞིན་གཤེགས་པའི་ཐུགས་རྗེ་ཆེན་པོ་འཇུག་གོ། །
en: Great tathāgata compassion extends to beings with the thought, ‘Sentient beings do not comprehend what is without contamination and appropriation. They should comprehend it.’

source: རིགས་ཀྱི་བུ་བྱང་ཆུབ་ནི་དག་པ་དང་། དྲི་མ་མེད་པ་དང་། ཉོན་མོངས་པ་མེད་པའོ། །
en: “Son of noble family, awakening is pure, stainless, and without afflictive emotions.

source: དེ་ལ་དག་པ་ནི་གང་།
en: In this regard, what is pure?

source: དྲི་མ་མེད་པ་ནི་གང་།
en: What is stainless?

source: ཉོན་མོངས་པ་མེད་པ་ནི་གང་ཞེ་ན།
en: What is without afflictive emotions?

source: སྟོང་པ་ཉིད་ནི་དག་པའོ། །
en: Emptiness is pure.

source: མཚན་མ་མེད་པ་ནི་དྲི་མ་མེད་པའོ། །
en: Signlessness is stainless.

source: སྨོན་པ་མེད་པ་ནི་ཉོན་མོངས་པ་མེད་པའོ། །
en: Wishlessness is without afflictive emotions.

source: སྐྱེ་བ་མེད་པ་ནི་དག་པའོ། །
en: The unborn is pure.

source: མངོན་པར་འདུ་བྱེད་པ་མེད་པ་ནི་དྲི་མ་མེད་པའོ། །
en: Absence of conditioning is stainless.

source: འབྱུང་བ་མེད་པ་ནི་ཉོན་མོངས་པ་མེད་པའོ། །
en: Nonarising is without afflictive emotions.

source: རང་བཞིན་ནི་དག་པའོ། །
en: The nature is pure.

source: ཡོངས་སུ་དག་པ་ནི་དྲི་མ་མེད་པའོ། །
en: Total purity is stainless.

source: འོད་གསལ་བ་ནི་ཉོན་མོངས་པ་མེད་པའོ། །
en: Luminosity is without afflictive emotions.

source: སྤྲོས་པ་མེད་པ་ནི་དག་པའོ། །
en: The absence of proliferation is pure.

source: མ་སྤྲོས་པ་ནི་དྲི་མ་མེད་པའོ། །
en: Non-proliferation is stainless.

source: སྤྲོས་པ་ཉེ་བར་ཞི་བ་ནི་ཉོན་མོངས་པ་མེད་པའོ། །
en: The pacification of proliferations is without afflictive emotions.

source: དེ་བཞིན་ཉིད་ནི་དག་པའོ། །
en: Suchness is pure.

source: ཆོས་ཀྱི་དབྱིངས་ནི་དྲི་མ་མེད་པའོ། །
en: The realm of phenomena is stainless.

source: ཡང་དག་པའི་མཐའ་ནི་ཉོན་མོངས་པ་མེད་པའོ། །
en: The limit of reality is without afflictive emotions.

source: སྐབས་འབྱེད་པ་ནི་དག་པའོ། །
en: Space is pure.

source: ནམ་མཁའ་ནི་དྲི་མ་མེད་པའོ། །
en: Space is stainless.

source: ནམ་མཁའ་ནི་ཉོན་མོངས་པ་མེད་པའོ། །
en: Space is without afflictive emotions.

source: ནང་ཡོངས་སུ་ཤེས་པ་ནི་དག་པའོ། །
en: Understanding inwardly is pure.

source: ཕྱི་རོལ་དུ་མི་རྒྱུ་བ་ནི་དྲི་མ་མེད་པའོ། །
en: Not pursuing outwardly is stainless.

source: ནང་དང་ཕྱི་མི་དམིགས་པ་ནི་ཉོན་མོངས་པ་མེད་པའོ། །
en: Not objectifying inwardly or outwardly is without afflictive emotions.

source: ཕུང་པོ་ཡོངས་སུ་ཤེས་པ་ནི་དག་པའོ། །
en: Understanding the aggregates is pure.

source: ཁམས་ཀྱི་ངོ་བོ་ཉིད་ནི་དྲི་མ་མེད་པའོ། །
en: The essence of the elements is stainless.

source: སྐྱེ་མཆེད་འདོར་བ་ནི་ཉོན་མོངས་པ་མེད་པའོ། །
en: Rejecting the sense fields is without afflictive emotions.

source: འདས་པ་ལ་ཟད་པར་ཤེས་པ་ནི་དག་པའོ། །
en: Understanding that the past is gone is pure.

source: མ་འོངས་པ་ལ་མི་སྐྱེ་བར་ཤེས་པ་ནི་དྲི་མ་མེད་པའོ། །
en: Understanding that the future has not yet arisen is stainless.

source: ད་ལྟར་བྱུང་བ་ལ་ཆོས་ཀྱི་དབྱིངས་གནས་པར་ཤེས་པ་ནི་ཉོན་མོངས་པ་མེད་པའོ། །
en: Understanding that the present is present as the realm of phenomena is without afflictive emotions.

source: དེ་ལྟར་ན་དག་པ་དང་། དྲི་མ་མེད་པ་དང་། ཉོན་མོངས་པ་མེད་པ་ནི་འདི་ལྟ་སྟེ། ཞི་བའི་གནས་ཀྱི་གནས་གཅིག་ཏུ་ཡང་དག་པར་འདུའོ། །
en: “Therefore purity, stainlessness, and the absence of afflictive emotions are actually united in the single state that is the state of peace.

source: ཞི་བ་གང་ཡིན་པ་དེ་རབ་ཏུ་ཞི་བའོ། །
en: Peace is peacefulness.

source: རབ་ཏུ་ཞི་བ་གང་ཡིན་པ་དེ་ཉེ་བར་ཞི་བའོ། །
en: Peacefulness is what is called pacification.

source: ཉེ་བར་ཞི་བ་གང་ཡིན་པ་དེ་ཉེ་བར་ཞི་བར་བྱེད་པས་མཚན་མ་མེད་པ་ཞེས་བྱའོ། །
en: Pacification is what is called the absence of signs by means of the act of pacifying.

source: མཚན་མ་མེད་པ་གང་ཡིན་པ་དེ་ཉེ་བར་ཞི་བའོ། །
en: The absence of signs is what is called pacification.

source: ཉེ་བར་ཞི་བ་གང་ཡིན་པ་དེ་བློ་གྲོས་ཞེས་བྱའོ། །
en: Pacification is what is called intelligence.

source: རིགས་ཀྱི་བུ་དེ་ལྟར་ན་ནམ་མཁའ་ཇི་ལྟ་བར་བྱང་ཆུབ་ཀྱང་དེ་བཞིན་ནོ། །
en: “Therefore, son of noble family, as is space, so too is awakening.

source: བྱང་ཆུབ་ཇི་ལྟ་བར་ཆོས་ཐམས་ཅད་ཀྱང་དེ་བཞིན་ནོ། །
en: As is awakening, so too are all phenomena.

source: ཆོས་རྣམས་ཇི་ལྟ་བར་སེམས་ཅན་རྣམས་ཀྱང་དེ་བཞིན་ནོ། །
en: As are all phenomena, so too are sentient beings.

source: སེམས་ཅན་རྣམས་ཇི་ལྟ་བར་ཞིང་རྣམས་ཀྱང་དེ་བཞིན་ནོ། །
en: As are sentient beings, so too are the buddhafields.

source: ཞིང་རྣམས་ཇི་ལྟ་བར་མྱ་ངན་ལས་འདས་པ་ཡང་དེ་བཞིན་ནོ། །
en: As are the buddhafields, so too is nirvāṇa.

source: དེས་ན་ཆོས་ཐམས་ཅད་ནི་མྱ་ངན་ལས་འདས་པ་དང་མཉམ་པ་ཞེས་བྱ་སྟེ། མཐར་ཕྱིན་ཅིང་མུར་ཐུག་པའི་ཕྱིར་གཉེན་པོ་མེད་པའོ། །
en: Thus, all phenomena are said to be equal to nirvāṇa. Because they are ultimate and final there are no remedies to apply.

source: གཉེན་པོ་མེད་པའི་ཕྱིར་ཆོས་ཐམས་ཅད་ནི་གཟོད་མ་ནས་དག་པ། གཟོད་མ་ནས་དྲི་མ་མེད་པ། གཟོད་མ་ནས་ཉོན་མོངས་པ་མེད་པའོ། །
en: Because there are no remedies to apply, all phenomena are primordially pure, primordially stainless, and primordially without afflictive emotions.

source: དེ་ལ་དེ་བཞིན་གཤེགས་པས་དེ་ལྟ་བུའི་ཚུལ་དང་འཐུན་པར་ཆོས་ཐམས་ཅད་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ཏེ།
en: Tathāgatas accordingly are completely and perfectly awakened to the reality of all phenomena.

source: མ་དག་པ་དང་། དྲི་མ་མེད་པ་མ་ཡིན་པ་དང་། ཉོན་མོངས་པ་དང་བཅས་པའི་སེམས་ཅན་གྱི་ཁམས་ལ་རྣམ་པར་གཟིགས་ནས་སེམས་ཅན་ཐམས་ཅད་ལ་རྣམ་པར་རོལ་པ་ཞེས་བྱ་བའི་ཐུགས་རྗེ་ཆེན་པོ་འཇུག་གོ། །
en: After surveying the mass of sentient beings who are impure, who are not stainless, and who possess afflictive emotions, they extend their great compassion known as magical play to all sentient beings.

source: དེ་བཞིན་གཤེགས་པ་ནི་ཐབས་མཁས་པས་ཚངས་པ་ལ་གཞེས་ཏེ། གསོལ་བ་མ་བཏབ་པར་ཆོས་ཀྱི་འཁོར་ལོ་མི་བསྐོར་རོ། །
en: “Using his skillful means, the Tathāgata informed the gods of the Brahmā realm that he would not turn the wheel of the Dharma without being requested to do so.

source: དེ་ནས་ཚངས་པ་གཙུག་ཕུད་ཅན་ཚངས་པ་བརྒྱ་སྟོང་ཕྲག་བརྒྱད་ཀྱིས་ཡོངས་སུ་བསྐོར་ཏེ། མདུན་དུ་བདར་ནས་ལྷན་ཅིག་ཏུ་ཚངས་པའི་འཇིག་རྟེན་ནས་མི་སྣང་བར་གྱུར་ཏེ་
en: Then Top-Knotted Brahmā, surrounded and escorted by eight hundred thousand gods of the Brahmā realm, instantly disappeared from the realm of Brahmā.

source: དེ་བཞིན་གཤེགས་པའི་སྤྱན་སྔར་འདུག་ནས། དེས་དེ་བཞིན་གཤེགས་པའི་ཞབས་གཉིས་ལ་གཏུགས་ཏེ་
en: He arrived in the presence of the Tathāgata and paid homage at the Tathāgata’s feet.

source: ཆོས་ཀྱི་འཁོར་ལོ་བསྐོར་བའི་སླད་དུ་བཅོམ་ལྡན་འདས་ཀྱིས་ཆོས་བཤད་དུ་གསོལ།
en: To ensure that the wheel of Dharma be set in motion, he supplicated the Tathāgata:

source: བདེ་བར་གཤེགས་པས་ཆོས་བཤད་དུ་གསོལ་ཞེས་དེ་བཞིན་གཤེགས་པ་ལ་གསོལ་བ་བཏབ་བོ། །
en: ‘May the Blessed One teach the Dharma! May the Sugata teach the Dharma!’

source: དེའི་ཚེ་ཚངས་པ་གཙུག་ཕུད་ཅན་གྱིས་དེ་བཞིན་གཤེགས་པ་ལ་ཚིགས་སུ་བཅད་པས་ཀྱང་གསོལ་པ།
en: He also supplicated the Tathāgata with the following words:

source: ཁྱོད་ཀྱི་ཆོས་ནི་ཞི་ཞིང་རབ་ཞི་ལ། །དག་ཅིང་རྣམ་དག་དྲི་མེད་འོད་གསལ་ཏེ། །བརྗོད་མེད་སྒྲ་མེད་ཡི་གེ་མེད་འཕགས་པར། །སངས་རྒྱས་ཡེ་ཤེས་ཀྱིས་ནི་ཐུགས་སུ་ཆུད། །
en: “ ‘Your Dharma, realized by buddha wisdom, Is peaceful and serene, pure and immaculate, Unsullied and radiant, Inexpressible, soundless, and without words.

source: ཡུན་རིང་གཉིད་ལོག་གཏི་མུག་རྒྱགས་པས་བསྒྲིབས། །ནོར་བའི་སེམས་ཅན་སད་པར་མཛད་དོན་དུ། །དེ་སླད་ཁྱོད་ཀྱིས་བསྐལ་པ་བྱེ་བར་ནི། །བརྟུལ་ཞུགས་དཀའ་ཐུབ་ཤིན་ཏུ་དཀའ་བ་སྤྱད། །
en: “ ‘You endured great hardships of asceticism and austerity For millions of eons To bring about the awakening of beings, confused and obscured By self-satisfaction, from the deep sleep of delusion.

source: གང་དག་སྔོན་གྱི་རྒྱལ་བའི་རྒྱུས་ལྷགས་པ། །དེ་དག་ཆོས་མཆོག་འདི་ནི་རྟོགས་འགྱུར་ཏེ། །འདི་ན་སེམས་ཅན་དགེ་བསམ་མང་མཆིས་ཀྱིས། །
en: “ ‘Those entrusted with the lineage of the previous victors Realized this supreme Dharma. On account of the many virtuous beings present herein,

source: དེ་བཞིན་གཤེགས་པས་ཆོས་རབ་འཁོར་ལོ་བསྐོར། །
en: May the Tathāgata turn the wheel of the Dharma.

source: ཁྱོད་ཀྱིས་བདུད་འཁོར་ཤིན་ཏུ་ཚར་བཅད་དེ། །
en: “ ‘You have subjugated the hosts of Māra

source: ཁྱོད་ཀྱིས་བདུད་རྩིའི་སྒོ་ནི་རབ་ཏུ་ཕྱེ། །
en: And opened the gate to the deathless.

source: དེད་དཔོན་ཆེན་པོ་ལམ་ལོག་འཁྱམས་པ་ཡི། །སེམས་ཅན་དག་ནི་འཕགས་པའི་ལམ་དུ་ཁྲིད། །
en: Great Leader, guide beings who have gone astray To the path of the noble ones!

source: ཁྱོད་ཀྱི་སངས་རྒྱས་ཐུགས་རྗེ་བླ་ན་མེད། །
en: “ ‘Your unsurpassed buddha compassion

source: འགྲོ་ལ་ཕན་པར་བསམ་གྱིས་མི་ཁྱབ་འཇུག །སྟོན་པ་ཁྱོད་ལ་བདག་ནི་གསོལ་འདེབས་ཀྱིས། །ཆོས་མཆོག་འཁོར་ལོ་རབ་ཏུ་བསྐོར་དུ་གསོལ། །
en: Benefits beings inconceivably. Teacher, I beg you, Please turn the wheel of the supreme Dharma!
